import logo1 from "../assets/ourClients/Logo (1).png";
import logo2 from "../assets/ourClients/Logo (2).png";
import logo3 from "../assets/ourClients/Logo (3).png";
import logo4 from "../assets/ourClients/Logo (4).png";
import logo5 from "../assets/ourClients/Logo (5).png";
import logo6 from "../assets/ourClients/Logo (6).png";
import logo7 from "../assets/ourClients/Logo (7).png";
import logo8 from "../assets/ourClients/Logo.png";

import serviseImage from "../assets/Frame 11.png";
import serviseImage2 from "../assets/Frame 11 (2).png";

export const service = [
  {
    id: 1,
    src: serviseImage,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 2,
    src: serviseImage2,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 3,
    src: serviseImage,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 4,
    src: serviseImage,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 5,
    src: serviseImage2,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 6,
    src: serviseImage,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 7,
    src: serviseImage,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 8,
    src: serviseImage2,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 9,
    src: serviseImage,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 10,
    src: serviseImage,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 11,
    src: serviseImage2,
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
];

export const serviceList = [
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
];

export const Data_Steps = [
  {
    step1: 1,
    title: "التقييم الفني للمحطة",
    description: "تحليل الوضع الحالي والأنظمة القائمة.",
  },
  {
    step1: 2,
    title: "إعداد خطة التشغيل والصيانة",
    description: "وفق طبيعة المحطة والطاقة الإنتاجية.",
  },
  {
    step1: 3,
    title: "التشغيل والمتابعة اليومية",
    description: "مراقبة الأداء وضمان الاستمرارية.",
  },
  {
    step1: 4,
    title: "الصيانة الوقائية والتصحيحية",
    description: "تقليل الأعطال ورفع كفاءة المعدات.",
  },
  {
    step1: 5,
    title: "التقارير والتحسين المستمر",
    description: "تقارير أداء دورية وتوصيات تطوير.",
  },
];

export const logos = [logo1, logo2, logo3, logo4, logo5, logo6, logo7, logo8];

import blog1 from "../assets/FacilityManagementImages/electricCarousel.png";

// Mock data for blogs
export const blogs = [
  {
    id: 1,
    title: "التحول الرقمي في إدارة المرافق: حلول ذكية مبتكرة",
    description:
      "اكتشف كيف تساعد الحلول الذكية في رفع الكفاءة، تقليل الهدر، وتحسين تجربة المستخدم في المنشآت.",
    image: blog1,
    date: "25 / 1 2026",
  },
  {
    id: 2,
    title: "التحول الرقمي في إدارة المرافق: حلول ذكية مبتكرة",
    description:
      "اكتشف كيف تساعد الحلول الذكية في رفع الكفاءة، تقليل الهدر، وتحسين تجربة المستخدم في المنشآت.",
    image: blog1,
    date: "25 / 1 2026",
  },
  {
    id: 3,
    title: "التحول الرقمي في إدارة المرافق: حلول ذكية مبتكرة",
    description:
      "اكتشف كيف تساعد الحلول الذكية في رفع الكفاءة، تقليل الهدر، وتحسين تجربة المستخدم في المنشآت.",
    image: blog1,
    date: "25 / 1 2026",
  },
  {
    id: 4,
    title: "التحول الرقمي في إدارة المرافق: حلول ذكية مبتكرة",
    description:
      "اكتشف كيف تساعد الحلول الذكية في رفع الكفاءة، تقليل الهدر، وتحسين تجربة المستخدم في المنشآت.",
    image: blog1,
    date: "25 / 1 2026",
  },
  {
    id: 5,
    title: "التحول الرقمي في إدارة المرافق: حلول ذكية مبتكرة",
    description:
      "اكتشف كيف تساعد الحلول الذكية في رفع الكفاءة، تقليل الهدر، وتحسين تجربة المستخدم في المنشآت.",
    image: blog1,
    date: "25 / 1 2026",
  },
  {
    id: 6,
    title: "التحول الرقمي في إدارة المرافق: حلول ذكية مبتكرة",
    description:
      "اكتشف كيف تساعد الحلول الذكية في رفع الكفاءة، تقليل الهدر، وتحسين تجربة المستخدم في المنشآت.",
    image: blog1,
    date: "25 / 1 2026",
  },
];
