import logo1 from "../assets/ourClients/Logo (1).png";
import logo2 from "../assets/ourClients/Logo (2).png";
import logo3 from "../assets/ourClients/Logo (3).png";
import logo4 from "../assets/ourClients/Logo (4).png";
import logo5 from "../assets/ourClients/Logo (5).png";
import logo6 from "../assets/ourClients/Logo (6).png";
import logo7 from "../assets/ourClients/Logo (7).png";
import logo8 from "../assets/ourClients/Logo.png";

export const service = [
  {
    id: 1,
    src: "src/assets/Frame 11.png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 2,
    src: "src/assets/Frame 11 (2).png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 3,
    src: "src/assets/Frame 11.png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 4,
    src: "src/assets/Frame 11.png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 5,
    src: "src/assets/Frame 11 (2).png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 6,
    src: "src/assets/Frame 11.png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 7,
    src: "src/assets/Frame 11.png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 8,
    src: "src/assets/Frame 11 (2).png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 9,
    src: "src/assets/Frame 11.png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 10,
    src: "src/assets/Frame 11.png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
  {
    id: 11,
    src: "src/assets/Frame 11 (2).png",
    title: "قطـاع صيانة وتشغيل محطات التحلية",
    description:
      "تشغيل وصيانة محطات التحلية وفق أعلى المعايير الفنية لضمان استمرارية الإنتاج وكفاءة الأداء وجودة المياه. وتحرص فرقنا الهندسية المتخصصة على مراقبة الأداء وتحليل كفاءة التشغيل بشكل مستمر، مما يساهم في تقليل الأعطال، ورفع جودة المياه المنتجة، وتحقيق التوافق مع الضوابط البيئية والصحية المعتمدة محليًا ودوليًا.",
  },
];

export const serviceList = [
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
  "التشغيل الكامل لمحطات التحلية",
];

export const Data_Steps = [
  {
    step1: 1,
    title: "التقييم الفني للمحطة",
    description: "تحليل الوضع الحالي والأنظمة القائمة.",
  },
  {
    step1: 2,
    title: "إعداد خطة التشغيل والصيانة",
    description: "وفق طبيعة المحطة والطاقة الإنتاجية.",
  },
  {
    step1: 3,
    title: "التشغيل والمتابعة اليومية",
    description: "مراقبة الأداء وضمان الاستمرارية.",
  },
  {
    step1: 4,
    title: "الصيانة الوقائية والتصحيحية",
    description: "تقليل الأعطال ورفع كفاءة المعدات.",
  },
  {
    step1: 5,
    title: "التقارير والتحسين المستمر",
    description: "تقارير أداء دورية وتوصيات تطوير.",
  },
];

export const logos = [logo1, logo2, logo3, logo4, logo5, logo6, logo7, logo8];
